from uni import Group, Room, Subject

LECTURERS = ['Пашко', 'Вергунова', 'Бобиль', 'Закала', 'Зінько', 'Мащенко', 'Тарануха',
             'Федорус', 'Мисечко', 'Ткаченко', 'Терещенко', 'Свистунов', 'Красовська',
             'Шишацька', 'Дорошенко', 'Крак', 'Чернега', 'Злотник', 'Башняков', 'Коробова',
             'Коваль', 'Криволап', 'Галавай', 'Башук', 'Бобиль', 'Федорус']

GROUPS = [Group('МІ-41', 20),
          Group('МІ-42', 22),
          Group('ТК-41', 18),
          Group('ТТП-41', 30),
          Group('ТТП-42', 28)]

ROOMS = [Room('43', 60),
         Room('235', 30),
         Room('705', 25),
         Room('704', 20),
         Room('233', 30),
         Room('221', 35),
         Room('306', 27),
         Room('204', 30),
         Room('303', 35),
         Room('308', 40),
         Room('309', 25),
         Room('3', 22)]

TIMESLOTS = ['08:40', '10:35', '12:20', '14:05']

DAYS = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"]

SUBJECTS = [Subject('Статистичне моделювання в задачах штучного інтелекту(лекція)', ['Пашко']),
            Subject('Складність алгоритмів(лекція)', ['Вергунова']),
            Subject('Нейронні мережі(лекція)', ['Бобиль']),
            Subject('Нейронні мережі(практика)', ['Бобиль', 'Закала']),
            Subject('Теорія прийняття рішень(лекція)', ['Мащенко']),
            Subject('Теорія прийняття рішень(практика)', ['Зінько']),
            Subject('Інтелектуальні системи(лекція)', ['Тарануха']),
            Subject('Інтелектуальні системи(практика)', ['Федорус', 'Мисечко']),
            Subject('Інформаційні технології(лекція)', ['Ткаченко']),
            Subject('Інформаційні технології(практика)', ['Терещенко', 'Свистунов']),
            Subject('Основи комп\'ютерної лінгвістики(лекція)', ['Тарануха']),
            Subject('Основи комп\'ютерної лінгвістики(практика)', ['Тарануха']),
            Subject('Іноземна мова(консультація)', ['Красовська']),
            Subject('Розробка ПЗ під мобільні платформи(лекція)', ['Ткаченко']),
            Subject('Основи управління ІТ-проєктами(лекція)', ['Шишацька']),
            Subject('Методи паралельних обчислень(лекція)', ['Дорошенко']),
            Subject('Розробка ПЗ(лекція)', ['Крак']),
            Subject('Проблеми штучного інтелекту(лекція)', ['Крак']),
            Subject('Розробка ПЗ під мобільні платформи(практика)', ['Криволап', 'Галавай']),
            Subject('Інформаційні системи(практика)', ['Мисечко', 'Башук']),
            Subject('Теорія прийняття рішень(практика)', ['Зінько', 'Башняков']),
            Subject('Інтелектуальні системи(практика)', ['Мисечко', 'Федорус'])]

PROGRAM = {'Пашко': 5,
           'Вергунова': 3,
           'Бобиль': 4.5,
           'Закала': 0.5,
           'Зінько': 0.5,
           'Мащенко': 5,
           'Тарануха': 8,
           'Федорус': 2,
           'Мисечко': 1,
           'Ткаченко': 5,
           'Терещенко': 1,
           'Свистунов': 1,
           'Красовська': 2.5,
           'Шишацька': 1,
           'Дорошенко': 1,
           'Крак': 5,
           'Чернега': 1,
           'Злотник': 1,
           'Башняков': 1,
           'Коробова': 1,
           'Коваль': 1,
           'Криволап': 1,
           'Галавай': 1,
           'Башук': 1,}